["<s>", "<e>", "<p>", "<S>", "<E>", "<P>", "!", "\"", "&", "(", ")", "*", "+", ",", "-", "--", "---", ".", "/", "0", "0.14", "0.4", "0.5", "0.7", "1", "1.5", "10", "2", "3", "4", "5", "6", "7", "8", "8.5", "9", ":", ";", "<", "=", ">", "?", "@", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "[", "\\", "\\!", "\\#", "\\&", "\\,", "\\:", "\\;", "\\Big", "\\Bigg", "\\Biggl", "\\Biggm", "\\Biggr", "\\Bigl", "\\Bigm", "\\Bigr", "\\Box", "\\Gamma", "\\Huge", "\\Im", "\\Join", "\\LARGE", "\\Lambda", "\\Large", "\\Leftarrow", "\\Leftrightarrow", "\\Longleftarrow", "\\Longleftrightarrow", "\\Longrightarrow", "\\Omega", "\\Phi", "\\Pi", "\\Psi", "\\Re", "\\Rightarrow", "\\S", "\\Sigma", "\\Theta", "\\Uparrow", "\\Upsilon", "\\V", "\\Vert", "\\Xi", "\\\\", "\\_", "\\acute", "\\aleph", "\\alpha", "\\amalg", "\\angle", "\\approx", "\\approxeq", "\\arabic", "\\arraystretch", "\\arrowvert", "\\ast", "\\asymp", "\\atop", "\\atopwithdelims", "\\backsim", "\\backslash", "\\bar", "\\bbox", "\\begin", "\\begin{aligned}", "\\begin{array}", "\\begin{cases}", "\\begin{matrix}", "\\beta", "\\bf", "\\big", "\\bigcap", "\\bigcirc", "\\bigcup", "\\bigg", "\\biggl", "\\biggm", "\\biggr", "\\bigl", "\\bigm", "\\bigoplus", "\\bigotimes", "\\bigr", "\\bigsqcup", "\\bigtriangledown", "\\bigtriangleup", "\\bigvee", "\\bigwedge", "\\binom", "\\blacklozenge", "\\bmod", "\\boldsymbol", "\\bot", "\\boxed", "\\boxtimes", "\\brace", "\\bracevert", "\\brack", "\\breve", "\\bullet", "\\cM", "\\cal", "\\cap", "\\cdot", "\\cdotp", "\\cdots", "\\ce", "\\cf", "\\cfrac", "\\check", "\\chi", "\\circ", "\\cl", "\\class", "\\colon", "\\cong", "\\coprod", "\\cup", "\\curlyvee", "\\curvearrowright", "\\d", "\\da", "\\dagger", "\\daleth", "\\dashrightarrow", "\\ddagger", "\\dddot", "\\ddot", "\\ddots", "\\def", "\\delta", "\\diagdown", "\\diagup", "\\diamond", "\\diamondsuit", "\\digamma", "\\displaystyle", "\\div", "\\dot", "\\doteq", "\\doteqdot", "\\dotplus", "\\dots", "\\dotsb", "\\dotsc", "\\dotsi", "\\dotsm", "\\downarrow", "\\ds", "\\ell", "\\emph", "\\emptyset", "\\end", "\\end{aligned}", "\\end{array}", "\\end{cases}", "\\end{matrix}", "\\enspace", "\\ensuremath", "\\epsilon", "\\eqalign", "\\eqref", "\\eqslantgtr", "\\equiv", "\\eta", "\\exists", "\\fbox", "\\flat", "\\forall", "\\frac", "\\frown", "\\gamma", "\\ge", "\\genfrac", "\\geq", "\\geqq", "\\geqslant", "\\gg", "\\ggg", "\\grave", "\\gt", "\\gtrless", "\\gtrsim", "\\hat", "\\hbar", "\\hline", "\\hookleftarrow", "\\hookrightarrow", "\\hphantom", "\\hslash", "\\idotsint", "\\iff", "\\iiint", "\\iint", "\\imath", "\\implies", "\\in", "\\infty", "\\int", "\\intercal", "\\iota", "\\it", "\\jmath", "\\kappa", "\\l", "\\la", "\\lam", "\\lambda", "\\land", "\\langle", "\\large", "\\lbrace", "\\lbrack", "\\lceil", "\\ldots", "\\le", "\\leadsto", "\\left", "\\left(", "\\left)", "\\left.", "\\left/", "\\left<", "\\left>", "\\left[", "\\left\\Vert", "\\left\\langle", "\\left\\lbrace", "\\left\\lbrack", "\\left\\lceil", "\\left\\lfloor", "\\left\\lmoustache", "\\left\\vert", "\\left\\{", "\\left\\|", "\\left]", "\\leftarrow", "\\leftrightarrow", "\\leftrightarrows", "\\left|", "\\leq", "\\leqq", "\\leqslant", "\\lesssim", "\\lfloor", "\\lgroup", "\\lhd", "\\ll", "\\llap", "\\longleftarrow", "\\longleftrightarrow", "\\longmapsto", "\\longrightarrow", "\\lor", "\\lrcorner", "\\lt", "\\ltimes", "\\lvert", "\\mapsto", "\\mathbb", "\\mathbf", "\\mathcal", "\\mathclose", "\\mathfrak", "\\mathit", "\\mathop", "\\mathopen", "\\mathord", "\\mathrel", "\\mathrm", "\\mathscr", "\\mathsf", "\\mathstrut", "\\mathtt", "\\mho", "\\mid", "\\mit", "\\mod", "\\mp", "\\mrm", "\\mu", "\\multicolumn", "\\nabla", "\\natural", "\\ne", "\\nearrow", "\\negmedspace", "\\negthickspace", "\\neq", "\\ni", "\\nmid", "\\nonumber", "\\normalsize", "\\not", "\\notag", "\\notin", "\\npi", "\\nsim", "\\nu", "\\nwarrow", "\\odot", "\\oint", "\\omega", "\\omicron", "\\ominus", "\\oplus", "\\oslash", "\\otimes", "\\overbrace", "\\overleftarrow", "\\overleftrightarrow", "\\overline", "\\overrightarrow", "\\overset", "\\overwithdelims", "\\owns", "\\pa", "\\parallel", "\\parbox", "\\partial", "\\pclo", "\\perp", "\\phantom", "\\phi", "\\phm", "\\pi", "\\pm", "\\pmb", "\\pmod", "\\prec", "\\preceq", "\\prime", "\\prod", "\\propto", "\\psi", "\\qi", "\\qquad", "\\quad", "\\raisebox", "\\rangle", "\\rbrace", "\\rbrack", "\\rceil", "\\renewcommand", "\\rfloor", "\\rgroup", "\\rhd", "\\rho", "\\right", "\\right(", "\\right)", "\\right.", "\\right/", "\\right<", "\\right>", "\\right\\Vert", "\\right\\rangle", "\\right\\rbrace", "\\right\\rbrack", "\\right\\rceil", "\\right\\rfloor", "\\right\\vert", "\\right\\|", "\\right\\}", "\\right]", "\\rightarrow", "\\rightharpoonup", "\\rightleftarrows", "\\rightleftharpoons", "\\right|", "\\rlap", "\\rtimes", "\\rule", "\\rvert", "\\scr", "\\scriptscriptstyle", "\\scriptsize", "\\scriptstyle", "\\searrow", "\\setminus", "\\sf", "\\sharp", "\\shortparallel", "\\sigma", "\\sim", "\\simeq", "\\skew", "\\small", "\\smallfrown", "\\smallint", "\\smash", "\\smile", "\\space", "\\sphericalangle", "\\sqcap", "\\sqcup", "\\sqrt", "\\square", "\\stackrel", "\\star", "\\strut", "\\subset", "\\subseteq", "\\substack", "\\succ", "\\succeq", "\\sum", "\\supset", "\\supseteq", "\\supseteqq", "\\surd", "\\swarrow", "\\tag", "\\tau", "\\temp", "\\textbf", "\\textit", "\\textrm", "\\textsf", "\\textstyle", "\\texttt", "\\theequation", "\\therefore", "\\theta", "\\thicksim", "\\thinspace", "\\tilde", "\\times", "\\tiny", "\\to", "\\top", "\\triangle", "\\triangleleft", "\\triangleq", "\\triangleright", "\\tt", "\\twoheadrightarrow", "\\underbrace", "\\underleftarrow", "\\underline", "\\underset", "\\unlhd", "\\uparrow", "\\uplus", "\\upsilon", "\\ut", "\\v", "\\varDelta", "\\varTheta", "\\varepsilon", "\\varkappa", "\\varphi", "\\varpi", "\\varpropto", "\\varrho", "\\varsigma", "\\vartheta", "\\vcenter", "\\vdash", "\\vdots", "\\vec", "\\vee", "\\verb", "\\vert", "\\vpha", "\\vpham", "\\vphantom", "\\wedge", "\\widehat", "\\widetilde", "\\wp", "\\wr", "\\xi", "\\xl", "\\xrightarrow", "\\zeta", "\\{", "\\|", "\\}", "]", "^", "_", "`", "a", "b", "c", "cm", "d", "e", "ex", "f", "g", "h", "i", "j", "k", "l", "m", "mm", "n", "o", "p", "pt", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "{", "|", "}", "~"]